oaq_specification/examples/dot/output_filters.dot
strict digraph "" {
    node [label="\N"];
    "NumericExpression1" [label="100", shape=box];
    "Port1" [label="Port", shape=box];
    "Port1" -> "NumericExpression1"  [label="Id", style=dashed];
    "Interval1" [label="50 ns", shape=box];
    "Interval2" [label="10 ns", shape=box];
    "Waveform1" [label="GaussianWaveform", shape=box];
    "Waveform1" -> "Interval1"  [label="Duration", style=dashed];
    "Waveform1" -> "Interval2"  [label="Sigma", style=dashed];
    "NumericExpression2" [label="0.5", shape=box];
    "Amplitude3" [label="Amplitude", shape=box];
    "Amplitude3" -> "NumericExpression2"  [label="Value", style=dashed];
    "Instruction1" [label="UnmodulatedPulse", shape=box];
    "Instruction1" -> "Port1"  [label="Port", style=dashed];
    "Instruction1" -> "Waveform1"  [label="Envelope", style=dashed];
    "Instruction1" -> "Amplitude3"  [label="Amplitude", style=dashed];
    "NumericExpression3" [label="0.01", shape=box];
    "Amplitude4" [label="Amplitude", shape=box];
    "Amplitude4" -> "NumericExpression3"  [label="Value", style=dashed];
    "Interval5" [label="1 μs", shape=box];
    "IirFilter6" [label="IirFilter", shape=box];
    "IirFilter6" -> "Amplitude4"  [label="Amplitude", style=dashed];
    "IirFilter6" -> "Interval5"  [label="TimeConstant", style=dashed];
    "NumericExpression4" [label="0.001", shape=box];
    "Amplitude7" [label="Amplitude", shape=box];
    "Amplitude7" -> "NumericExpression4"  [label="Value", style=dashed];
    "Interval8" [label="500 ns", shape=box];
    "IirFilter9" [label="IirFilter", shape=box];
    "IirFilter9" -> "Amplitude7"  [label="Amplitude", style=dashed];
    "IirFilter9" -> "Interval8"  [label="TimeConstant", style=dashed];
    "NumericRangeExpression1:Values" [label="0.1, 0.15, 0.5, ..., 0.1", shape=box];
    "NumericRangeExpression1" [label="LiteralNumericRange", shape=box];
    "NumericRangeExpression1" -> "NumericRangeExpression1:Values"  [label="Values", style=dashed];
    "FirFilter10" [label="FirFilter", shape=box];
    "FirFilter10" -> "NumericRangeExpression1"  [label="Taps", style=dashed];
    "Instruction2" [label="FilterOutput", shape=box];
    "Instruction2" -> "Port1"  [label="Port", style=dashed];
    "Instruction2" -> "Instruction1"  [label="Scope1", style=dashed];
    "Instruction2" -> "IirFilter6"  [label="IirFilters1", style=dashed];
    "Instruction2" -> "IirFilter9"  [label="IirFilters2", style=dashed];
    "Instruction2" -> "FirFilter10"  [label="FirFilter", style=dashed];
    "Job" [label="Job", shape=box];
    "Job" -> "Instruction2"  [label="EntryPoint1", style=dashed];
}
